---
type: Categories
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# Categories

`Autodesk.Revit.DB.Categories` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Contains | — | `public override bool Contains ( string name )` |
| Method | ForwardIterator | — | `public override CategoryNameMapIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public override IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public override bool Insert ( string key , Category item )` |
| Method | NewSubcategory | — | `public Category NewSubcategory ( Category parentCategory , string name )` |
| Method | ReverseIterator | — | `public override CategoryNameMapIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public override bool IsEmpty { get ; }` |
| Property | Item | — | `` |
| Property | Size | — | `public override int Size { get ; }` |